In [1]:
#import dependencies
import pandas as pd

In [2]:
#create csv path
stats = "InvoiceStats.csv"

# Read the CSV into a Pandas DataFrame
inv_stats = pd.read_csv(stats)

inv_stats.head()

,Billing Group,Invoice Status,Servicing Dealer,Dealer Invoice,Requested Amount,Approved Amount,Invoice Create Date,Invoice Issue?
0,KN,Cancel,60791,V30098805,1050.15,0.0,02-26-2021,No
1,ML,Cancel,60791,V30099281,1835.30,0.0,03-18-2021,No
2,KN,Cancel,60791,V30102014,2685.00,0.0,06-03-2021,No
3,HD,Cancel,60792,V20091751,1152.30,0.0,06-09-2021,No
4,XPO,Cancel,60791,V30102750,6176.30,0.0,06-17-2021,No

## Data Cleaning

In [3]:
#Reorganize columns and drop unnecessary columns

inv_stats = inv_stats[["Servicing Dealer", "Invoice Issue?", "Requested Amount", "Invoice Create Date"]]

inv_stats.head()

   Servicing Dealer Invoice Issue?  Requested Amount Invoice Create Date
0             60791             No           1050.15          02-26-2021
1             60791             No           1835.30          03-18-2021
2             60791             No           2685.00          06-03-2021
3             60792             No           1152.30          06-09-2021
4             60791             No           6176.30          06-17-2021

In [4]:
#rename columns

inv_stats = inv_stats.rename(columns={"Servicing Dealer":"Branch", "Invoice Issue?":"Inv_Issue", "Requested Amount":"Inv_Amt", 
                                      "Invoice Create Date":"Inv_Date"})


inv_stats.dtypes

Branch         int64
Inv_Issue     object
Inv_Amt      float64
Inv_Date      object
dtype: object

In [5]:
#rename branch number to abbreviation
inv_stats = inv_stats.replace({60789:"DEN", 60790:"DEN", 60791:"SLC", 60792:"ABQ"})

inv_stats.head()

  Branch Inv_Issue  Inv_Amt    Inv_Date
0    SLC        No  1050.15  02-26-2021
1    SLC        No  1835.30  03-18-2021
2    SLC        No  2685.00  06-03-2021
3    ABQ        No  1152.30  06-09-2021
4    SLC        No  6176.30  06-17-2021

In [6]:
#update Date column to datetime

inv_stats["Inv_Date"] = pd.to_datetime(inv_stats["Inv_Date"])

inv_stats.head()

  Branch Inv_Issue  Inv_Amt   Inv_Date
0    SLC        No  1050.15 2021-02-26
1    SLC        No  1835.30 2021-03-18
2    SLC        No  2685.00 2021-06-03
3    ABQ        No  1152.30 2021-06-09
4    SLC        No  6176.30 2021-06-17

In [7]:
#create new column for month 
inv_stats["Month"] = inv_stats["Inv_Date"].dt.month
inv_stats.head()

  Branch Inv_Issue  Inv_Amt   Inv_Date  Month
0    SLC        No  1050.15 2021-02-26      2
1    SLC        No  1835.30 2021-03-18      3
2    SLC        No  2685.00 2021-06-03      6
3    ABQ        No  1152.30 2021-06-09      6
4    SLC        No  6176.30 2021-06-17      6

In [8]:
#replace Month number with name

inv_stats["Month"] = inv_stats["Month"].replace({1:"January", 2:"February", 3:"March", 4:"April", 5:"May", 6:"June", 
                                                         7:"July", 8:"August", 9:"September", 10:"October", 11:"November", 
                                                         12:"December"})

inv_stats.head()

  Branch Inv_Issue  Inv_Amt   Inv_Date     Month
0    SLC        No  1050.15 2021-02-26  February
1    SLC        No  1835.30 2021-03-18     March
2    SLC        No  2685.00 2021-06-03      June
3    ABQ        No  1152.30 2021-06-09      June
4    SLC        No  6176.30 2021-06-17      June

In [9]:
#Reorganize columns and drop unnecessary columns

cleaninv_stats = inv_stats[["Branch","Inv_Issue", "Inv_Amt", "Month"]]

cleaninv_stats.head()

  Branch Inv_Issue  Inv_Amt     Month
0    SLC        No  1050.15  February
1    SLC        No  1835.30     March
2    SLC        No  2685.00      June
3    ABQ        No  1152.30      June
4    SLC        No  6176.30      June

## Branch Monthly Invoice $$

In [10]:
#branch $$
#ABQ
abq_monthly = cleaninv_stats[cleaninv_stats.Branch == "ABQ"]

abq_monthly_dollars = abq_monthly.groupby(["Month"]).sum("Inv_Amt")
abq_monthly_dollars = abq_monthly_dollars["Inv_Amt"]

abq_dollars = pd.DataFrame({"January":[abq_monthly_dollars.January], "February":[abq_monthly_dollars.February], "March":[abq_monthly_dollars.March],
                           "April":[abq_monthly_dollars.April], "May":[abq_monthly_dollars.May], "June":[abq_monthly_dollars.June],
                           "July":[abq_monthly_dollars.July], "August":[abq_monthly_dollars.August], "September":[abq_monthly_dollars.September],
                           "October":[abq_monthly_dollars.October], "November":[abq_monthly_dollars.November], "December":[abq_monthly_dollars.December]})

abq_dollars = abq_dollars.rename({0: "ABQ"})



#DEN
den_monthly = cleaninv_stats[cleaninv_stats.Branch == "DEN"]

den_monthly_dollars = den_monthly.groupby(["Month"]).sum("Inv_Amt")
den_monthly_dollars = den_monthly_dollars["Inv_Amt"]

den_dollars = pd.DataFrame({"January":[den_monthly_dollars.January], "February":[den_monthly_dollars.February], "March":[den_monthly_dollars.March],
                           "April":[den_monthly_dollars.April], "May":[den_monthly_dollars.May], "June":[den_monthly_dollars.June],
                           "July":[den_monthly_dollars.July], "August":[den_monthly_dollars.August], "September":[den_monthly_dollars.September],
                           "October":[den_monthly_dollars.October], "November":[den_monthly_dollars.November], "December":[den_monthly_dollars.December]})

den_dollars = den_dollars.rename({0: "DEN"})



#SLC
slc_monthly = cleaninv_stats[cleaninv_stats.Branch == "SLC"]

slc_monthly_dollars = slc_monthly.groupby(["Month"]).sum("Inv_Amt")
slc_monthly_dollars = slc_monthly_dollars["Inv_Amt"]

slc_dollars = pd.DataFrame({"January":[slc_monthly_dollars.January], "February":[slc_monthly_dollars.February], "March":[slc_monthly_dollars.March],
                           "April":[slc_monthly_dollars.April], "May":[slc_monthly_dollars.May], "June":[slc_monthly_dollars.June],
                           "July":[slc_monthly_dollars.July], "August":[slc_monthly_dollars.August], "September":[slc_monthly_dollars.September],
                           "October":[slc_monthly_dollars.October], "November":[slc_monthly_dollars.November], "December":[slc_monthly_dollars.December]})

slc_dollars = slc_dollars.rename({0: "SLC"})

In [11]:
#Create new DF recombining branches
dollars = [abq_dollars, den_dollars, slc_dollars]

dollars_summary = pd.concat(dollars)

dollars_summary

,January,February,March,April,May,June,July,August,September,October,November,December
ABQ,4254.40,6598.89,1677.89,6300.75,2202.53,3762.18,6953.55,4699.63,5114.05,13331.84,6775.89,3668.31
DEN,94960.72,70850.77,83968.00,102253.32,60787.47,65215.26,108339.64,94014.83,106473.01,121543.66,79749.09,111680.20
SLC,83072.58,46567.95,76024.56,89303.13,39745.15,69909.70,51973.22,76697.73,100196.56,92508.79,100287.15,90630.01

In [12]:
#Calculate Monthly Invoice Total for all Branches/Depts
total_monthly = dollars_summary.sum(axis=0)

total_monthly

January      182287.70
February     124017.61
March        161670.45
April        197857.20
May          102735.15
June         138887.14
July         167266.41
August       175412.19
September    211783.62
October      227384.29
November     186812.13
December     205978.52
dtype: float64

In [13]:
#rename axis to Branch
dollars_summary = dollars_summary.rename_axis("Branch")

dollars_summary

,January,February,March,April,May,June,July,August,September,October,November,December
Branch,,,,,,,,,,,,
ABQ,4254.40,6598.89,1677.89,6300.75,2202.53,3762.18,6953.55,4699.63,5114.05,13331.84,6775.89,3668.31
DEN,94960.72,70850.77,83968.00,102253.32,60787.47,65215.26,108339.64,94014.83,106473.01,121543.66,79749.09,111680.20
SLC,83072.58,46567.95,76024.56,89303.13,39745.15,69909.70,51973.22,76697.73,100196.56,92508.79,100287.15,90630.01

In [14]:
#Create DF for monthly totals
monthly_total = pd.DataFrame({"January":[total_monthly.January], "February":[total_monthly.February], "March":[total_monthly.March],
                           "April":[total_monthly.April], "May":[total_monthly.May], "June":[total_monthly.June],"July":[total_monthly.July],
                           "August":[total_monthly.August], "September":[total_monthly.September], "October":[total_monthly.October], 
                           "November":[total_monthly.November], "December":[total_monthly.December]})

monthly_total = monthly_total.rename({0:"Total"})


monthly_total

,January,February,March,April,May,June,July,August,September,October,November,December
Total,182287.7,124017.61,161670.45,197857.2,102735.15,138887.14,167266.41,175412.19,211783.62,227384.29,186812.13,205978.52

In [15]:
#Combine monthly totals with main DF

monthly_inv = dollars_summary.append(monthly_total)

monthly_inv

,January,February,March,April,May,June,July,August,September,October,November,December
ABQ,4254.40,6598.89,1677.89,6300.75,2202.53,3762.18,6953.55,4699.63,5114.05,13331.84,6775.89,3668.31
DEN,94960.72,70850.77,83968.00,102253.32,60787.47,65215.26,108339.64,94014.83,106473.01,121543.66,79749.09,111680.20
SLC,83072.58,46567.95,76024.56,89303.13,39745.15,69909.70,51973.22,76697.73,100196.56,92508.79,100287.15,90630.01
Total,182287.70,124017.61,161670.45,197857.20,102735.15,138887.14,167266.41,175412.19,211783.62,227384.29,186812.13,205978.52

In [16]:
monthly_inv["Annual$"] = monthly_inv.sum(axis=1)

In [17]:
monthly_inv = monthly_inv.rename_axis("Branch")

monthly_inv

,January,February,March,April,May,June,July,August,September,October,November,December,Annual$
Branch,,,,,,,,,,,,,
ABQ,4254.40,6598.89,1677.89,6300.75,2202.53,3762.18,6953.55,4699.63,5114.05,13331.84,6775.89,3668.31,65339.91
DEN,94960.72,70850.77,83968.00,102253.32,60787.47,65215.26,108339.64,94014.83,106473.01,121543.66,79749.09,111680.20,1099835.97
SLC,83072.58,46567.95,76024.56,89303.13,39745.15,69909.70,51973.22,76697.73,100196.56,92508.79,100287.15,90630.01,916916.53
Total,182287.70,124017.61,161670.45,197857.20,102735.15,138887.14,167266.41,175412.19,211783.62,227384.29,186812.13,205978.52,2082092.41

## Branch Inv Stats - Inv Count/Error Vs. No Error/Error %

In [18]:
#create new dataframe with summary of total number of invoices, invoices with and without errors and percentage per branch

#branch total invoice count
branch_total = inv_stats["Branch"].value_counts()


#branch inv count with errors
#filter main DF to only show "Yes" in Inv_Issue column
stats = inv_stats[inv_stats.Inv_Issue == "Yes"]
#count of invoices with issues per branch
issue = stats.groupby(["Branch"]).count()["Inv_Issue"]

#subtract inv issues from total to calculate no issues
no_issue = branch_total - issue

#calculate percentage with error
percent = issue/branch_total *100

In [19]:
#new DF
stat_summary = pd.DataFrame({"Total_Inv": branch_total, "Issue": issue, "No_Issue":no_issue, "Issue_Percent":percent})

stat_summary

     Total_Inv  Issue  No_Issue  Issue_Percent
ABQ        191    103        88      53.926702
DEN       3199    968      2231      30.259456
SLC       2200   1189      1011      54.045455

In [20]:
#caculate totals for each column

#total invoices
summary_total = stat_summary["Total_Inv"].sum()

#total invoices with issues
issue_total = stat_summary["Issue"].sum()

#total invoices without issues
no_issue_total = stat_summary["No_Issue"].sum()

#percentage with error
percent_total = issue_total/summary_total *100



#create new DF to merge with stat_summary
total_summary = pd.DataFrame({"Total_Inv": [summary_total], "Issue":[issue_total], "No_Issue":[no_issue_total], 
                              "Issue_Percent":[percent_total]})

total_summary

   Total_Inv  Issue  No_Issue  Issue_Percent
0       5590   2260      3330      40.429338

In [21]:
#merge both summary DFs
summary = stat_summary.append(total_summary)

summary = summary.round({"Issue_Percent":2})

summary

     Total_Inv  Issue  No_Issue  Issue_Percent
ABQ        191    103        88          53.93
DEN       3199    968      2231          30.26
SLC       2200   1189      1011          54.05
0         5590   2260      3330          40.43

In [22]:
#rename index 0 to Total
clean_summary=summary.rename({0: "Total"})

#rename axis to Branch
branch_stat_summary = clean_summary.rename_axis("Branch")

branch_stat_summary

        Total_Inv  Issue  No_Issue  Issue_Percent
Branch
ABQ           191    103        88          53.93
DEN          3199    968      2231          30.26
SLC          2200   1189      1011          54.05
Total        5590   2260      3330          40.43

## Combine 2 Summary DFs

In [23]:
inv_stats = pd.merge(monthly_inv, branch_stat_summary, on="Branch", how="left")

inv_stats = inv_stats.round({"January":2, "February":2, "March":2, "April":2, "May":2, "June":2, "July":2, "August":2, 
                            "September":2, "October":2, "November":2, "December":2, "Annual$":2 })

inv_stats

,January,February,March,April,May,June,July,August,September,October,November,December,Annual$,Total_Inv,Issue,No_Issue,Issue_Percent
Branch,,,,,,,,,,,,,,,,,
ABQ,4254.40,6598.89,1677.89,6300.75,2202.53,3762.18,6953.55,4699.63,5114.05,13331.84,6775.89,3668.31,65339.91,191,103,88,53.93
DEN,94960.72,70850.77,83968.00,102253.32,60787.47,65215.26,108339.64,94014.83,106473.01,121543.66,79749.09,111680.20,1099835.97,3199,968,2231,30.26
SLC,83072.58,46567.95,76024.56,89303.13,39745.15,69909.70,51973.22,76697.73,100196.56,92508.79,100287.15,90630.01,916916.53,2200,1189,1011,54.05
Total,182287.70,124017.61,161670.45,197857.20,102735.15,138887.14,167266.41,175412.19,211783.62,227384.29,186812.13,205978.52,2082092.41,5590,2260,3330,40.43

In [25]:
#create summary csv
inv_stats.to_csv("CleanData/InvStats.csv")